In [2]:
import pandas as pd

In [11]:
df_movies = pd.read_csv("data/movies.csv")

In [7]:
df_users = pd.read_csv("data/users.csv")

In [9]:
df_ratings = pd.read_csv("data/ratings.csv")

In [14]:
df_movies = df_movies.drop(columns=["Unnamed: 0"])

In [20]:
df_ratings = df_ratings.drop(columns=["Unnamed: 0"])

In [17]:
df_users = df_users.drop(columns=["Unnamed: 0"])

In [25]:
df_movies.head()

   movie_id                               title                        genres
0         2                      Jumanji (1995)  Adventure|Children's|Fantasy
1         3             Grumpier Old Men (1995)                Comedy|Romance
2         4            Waiting to Exhale (1995)                  Comedy|Drama
3         5  Father of the Bride Part II (1995)                        Comedy
4         6                         Heat (1995)         Action|Crime|Thriller

In [18]:
df_users.head()

   id gender  age            occupation zipcode
0   2      M   56         self-employed   70072
1   3      M   25             scientist   55117
2   4      M   45  executive/managerial   02460
3   5      M   25                writer   55455
4   6      F   50             homemaker   55117

In [21]:
df_ratings.head()

   movie_id  rating            timestamp  user_id
0       858       4  2000-04-25 16:05:32     6040
1      2384       4  2000-04-25 16:05:54     6040
2       593       5  2000-04-25 16:05:54     6040
3      1961       4  2000-04-25 16:06:17     6040
4      1419       3  2000-04-25 16:07:36     6040

In [24]:
ratings_users.head()

,movie_id,rating,timestamp,user_id,id,gender,age,occupation,zipcode
0,858,4,2000-04-25 16:05:32,6040,6040,M,25,doctor/health care,11106
1,2384,4,2000-04-25 16:05:54,6040,6040,M,25,doctor/health care,11106
2,593,5,2000-04-25 16:05:54,6040,6040,M,25,doctor/health care,11106
3,1961,4,2000-04-25 16:06:17,6040,6040,M,25,doctor/health care,11106
4,1419,3,2000-04-25 16:07:36,6040,6040,M,25,doctor/health care,11106

In [27]:
ratings_users = pd.merge(df_ratings, df_users, left_on="user_id", right_on="id")

In [28]:
pd.merge(ratings_users, df_movies, left_on="movie_id", right_on="movie_id").head()

,movie_id,rating,timestamp,user_id,id,gender,age,occupation,zipcode,title,genres
0,858,4,2000-04-25 16:05:32,6040,6040,M,25,doctor/health care,11106,"Godfather, The (1972)",Action|Crime|Drama
1,858,4,2000-04-26 07:06:13,6039,6039,F,45,other,01060,"Godfather, The (1972)",Action|Crime|Drama
2,858,5,2000-04-25 17:31:58,6037,6037,F,45,academic/educator,76006,"Godfather, The (1972)",Action|Crime|Drama
3,858,4,2000-04-25 18:50:38,6033,6033,M,50,retired,78232,"Godfather, The (1972)",Action|Crime|Drama
4,858,4,2000-04-25 21:29:53,6028,6028,M,18,college/grad student,94133,"Godfather, The (1972)",Action|Crime|Drama

In [29]:
ratings_all =pd.merge(ratings_users, df_movies, left_on="movie_id", right_on="movie_id")

In [30]:
ratings_all = ratings_all.drop(columns=["id"]).head()

,movie_id,rating,timestamp,user_id,gender,age,occupation,zipcode,title,genres
0,858,4,2000-04-25 16:05:32,6040,M,25,doctor/health care,11106,"Godfather, The (1972)",Action|Crime|Drama
1,858,4,2000-04-26 07:06:13,6039,F,45,other,01060,"Godfather, The (1972)",Action|Crime|Drama
2,858,5,2000-04-25 17:31:58,6037,F,45,academic/educator,76006,"Godfather, The (1972)",Action|Crime|Drama
3,858,4,2000-04-25 18:50:38,6033,M,50,retired,78232,"Godfather, The (1972)",Action|Crime|Drama
4,858,4,2000-04-25 21:29:53,6028,M,18,college/grad student,94133,"Godfather, The (1972)",Action|Crime|Drama

In [31]:
ratings_all.to_csv("data/ratings_all.csv")